Tekla.Structures.DialogInternal.LocalDataStorage
Local data storage for temporarily storing dialog values

Tekla.Structures.DialogInternal.LocalDataStorage.GetVariable(Tekla.Structures.DialogInternal.AttributeInfo)
Get a variable by the give name
info: The AttributeInfo struct that contains the variable information.
Returns: The value of the requested variable

Tekla.Structures.DialogInternal.LocalDataStorage.SetVariable(Tekla.Structures.DialogInternal.AttributeInfo,System.String)
Set a value for a variable
info: The AttributeInfo struct that contains the variable information.
dialogname: The name of the dialog for the variable information.

Tekla.Structures.DialogInternal.LocalDataStorage.SetVariableToStack(System.String,System.Object)
Sets a value for the named variable to stack.
name: The name of the variable.
data: The value of the variable.